datastructures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-06 Thu 14:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9a6a589">1. Hash tables</a>
<ul>
<li><a href="#org52a8a03">1.1. Simple insertion steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9a6a589" class="outline-2">
<h2 id="org9a6a589"><span class="section-number-2">1.</span> Hash tables</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Hash table maps keys to value for highly efficient lookup.</li>
<li>There are two ways to implements them :
<dl class="org-dl">
<dt>Using an array and a linked list</dt><dd>take more space / more efficient, lookup time is O(1) if the number of collision of not too high <span class="underline">O(n) in that case.</span></dd>
<dt>Using binary search tree</dt><dd>optimize on the space size / lookup in order / lookup in O(logn)</dd>
</dl></li>
</ul>
</div>
<div id="outline-container-org52a8a03" class="outline-3">
<h3 id="org52a8a03"><span class="section-number-3">1.1.</span> Simple insertion steps</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>First, <b>compute the key's hash code</b> to make correspondance with its place in our datastructure. (<i>Two different keys could have the same hash code, because there may be an infinite number of keys and a finite number of places where to store your keys' values</i>)</li>
<li><b>Map the hash code to an index</b> in the array (first method). You could do that using something like <code>hash(key) % array_length</code>. (<i>Two different hash codes could map to the same index</i>)</li>
<li>At the index, you store a <b>linked list</b> of keys and values pairs. <b>Because of collisions of keys</b> (two keys having the same hash code, or two hash code mapping to the same index) we use linked list.</li>
</ol>


<div class="note" id="org2f61e43">
<p>
To retrieve the value pair by its key, you repeat this process.
</p>
<ol class="org-ol">
<li>Compute the hash code from the key</li>
<li>Compute the index from the hash code</li>
<li>Search through the linked list for the value with this key.</li>
</ol>

</div>



<p>
<code>(page 100)</code>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-03-06 Thu 14:52</p>
</div>
</body>
</html>
